hanwckf/ch554_sdcc/examples/serprog/main.c
    }
}

__idata uint32_t slen;
__idata uint32_t rlen;
__idata int8_t usb_send_length = 0;
__idata uint8_t recv_index = 0;

void usb_send(uint8_t length)
{
    UEP2_T_LEN = length; // Pre-use send length must be cleared
    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; // Answer ACK
    UpPoint2_Busy = 1;
}

uint8_t recv_buf_getc()
{
    uint8_t tmp;
    while(USBByteCount == 0);
    tmp = Ep2Buffer[recv_index];
    recv_index++;
    if (recv_index == USBByteCount) {
        recv_index = 0;
        USBByteCount = 0;
        UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
    }
    return tmp;
}

void handle_command()
{
    uint32_t i = 0;
    uint8_t j = 0, k = 0;
    uint8_t c = recv_buf_getc();

    while(UpPoint2_Busy);
    LED = !LED;

    switch(c) {
    case S_CMD_NOP:
        Ep2Buffer[64 + 0] = S_ACK;
        usb_send_length = 1;
        break;

    case S_CMD_Q_IFACE:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = 0x1;
        Ep2Buffer[64 + 2] = 0x0;
        usb_send_length = 3;
        break;

    case S_CMD_Q_CMDMAP:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = (CMD_MAP & 0xff);
        Ep2Buffer[64 + 2] = ((CMD_MAP >> 8) & 0xff);
        Ep2Buffer[64 + 3] = ((CMD_MAP >> 16) & 0xff);
        Ep2Buffer[64 + 4] = ((CMD_MAP >> 24) & 0xff);
        for (i = 5; i < 33; i++)
            Ep2Buffer[64 + i] = 0;
        usb_send_length = 33;
        break;

    case S_CMD_Q_PGMNAME:
        Ep2Buffer[64 + 0] = S_ACK;
        while (PGMNAME[i])
        {
            Ep2Buffer[64 + i+1] = PGMNAME[i];
            i++;
        }
        for (; i < 16; i++)
            Ep2Buffer[64 + i+1] = 0;
        usb_send_length = 17;
        break;

    case S_CMD_Q_SERBUF:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = 0xff;
        Ep2Buffer[64 + 2] = 0xff;
        usb_send_length = 3;
        break;

    case S_CMD_Q_BUSTYPE:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = BUS_SPI;
        usb_send_length = 2;
        break;

    case S_CMD_SYNCNOP:
        Ep2Buffer[64 + 0] = S_NAK;
        Ep2Buffer[64 + 1] = S_ACK;
        usb_send_length = 2;
        break;

    case S_CMD_S_BUSTYPE:
        if ( (recv_buf_getc()|BUS_SPI) == BUS_SPI)
            Ep2Buffer[64 + 0] = S_ACK;
        else
            Ep2Buffer[64 + 0] = S_NAK;
        usb_send_length = 1;
        break;

    case S_CMD_O_SPIOP:
        Ep2Buffer[64 + 0] = S_ACK;
        usb_send_length = 1;
        usb_send(usb_send_length);
        usb_send_length = 0;
        while(UpPoint2_Busy);

        slen = recv_buf_getc() | ((uint32_t)recv_buf_getc() << 8) | (((uint32_t)recv_buf_getc()) << 16);
        rlen = recv_buf_getc() | ((uint32_t)recv_buf_getc() << 8) | (((uint32_t)recv_buf_getc()) << 16);

        CS = 0;
        if (slen > 0) {
            for (i = 0; i < slen; i++)
                CH554SPIMasterWrite(recv_buf_getc());
        }
        k = 0;
        if (rlen > 0) {
            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_NAK;       //NAK
            for (i = 0; i < (rlen/64); i++) {
                if ( k == 0 ) {
                    for (j = 64; j < 128; j++) {
                        SPI0_DATA = 0xff;
                        while(S0_FREE == 0);
                        Ep2Buffer[j] = SPI0_DATA;
                    }
                } else {
                    for (j = 64; j < 128; j++) {
                        SPI0_DATA = 0xff;
                        while(S0_FREE == 0);
                        Ep2Buffer_1[j] = SPI0_DATA;
                    }
                }
                while(UpPoint2_Busy);
                if ( k == 0 )
                    UEP2_DMA = (uint16_t) Ep2Buffer;                                                      //Endpoint 2 IN data transfer address
                else
                    UEP2_DMA = (uint16_t) Ep2Buffer_1;                                                      //Endpoint 2 IN data transfer address
                k ^= 0x01;
                usb_send(64);
            }

            k = rlen%64;
            while(UpPoint2_Busy);
            UEP2_DMA = (uint16_t) Ep2Buffer;                                                      //Endpoint 2 IN data transfer address
            for (j = 64; j < k + 64; j++) {
                SPI0_DATA = 0xff;
                while(S0_FREE == 0);
                Ep2Buffer[j] = SPI0_DATA;
            }
            usb_send(k);
            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
            while(UpPoint2_Busy);
        }
        CS = 1;
        break;

    default:
        Ep2Buffer[64 + 0] = S_NAK;
        usb_send_length = 1;
        break;
    }

    if (usb_send_length > 0)
        usb_send(usb_send_length);

}

void Uart0_ISR(void) __interrupt (INT_NO_UART0)
{
    if(RI)   //收到数据
    {
        Receive_Uart_Buf[Uart_Input_Point++] = SBUF;
        UartByteCount++;                    //Number of bytes remaining in the current buffer
        if(Uart_Input_Point>=UART_REV_LEN)
            Uart_Input_Point = 0;           //Write pointer
        RI=0;
    }
}



void main()
{
    uint8_t length;
    uint8_t Uart_Timeout = 0;
    uint8_t recievedData[MAX_PACKET_SIZE] ="";

    CfgFsys();
    mDelaymS(5);

    P3_DIR_PU &= ~(1 << MODE_PIN);
    P3_MOD_OC &= ~(1 << MODE_PIN);

    if (BUTTON == 0)
        mode = 1;

    // Configure pin 3.3 as led ctl
    P3_DIR_PU |= (1 << LED_PIN);
    P3_MOD_OC &= ~(1 << LED_PIN);

    if (mode == 0) {
        // Configure pin 1.0 as spi cs ctl
        P1_MOD_OC = 0x00 | (1 << 6);
        P1_DIR_PU = 0;
        P1_DIR_PU |= ((1 << CS_PIN) | (1 << 5) | (1 << 6) | (1 << 7));

        SPI0_SETUP = 0;                                                       //Master模式,高位在前
        SPI0_CTRL = 0x60;                                                     //模式0
        SPI0_CK_SE = 0x02;

        USBDeviceCfg();
        USBDeviceEndPointCfg();                                               // Endpoint configuration
        USBDeviceIntCfg();                                                    //Interrupt initialization
        UEP0_T_LEN = 0;
        UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
        UEP2_T_LEN = 0;                                                       //Pre-use send length must be cleared

        while(!UsbConfig) {
            LED = !LED;
            mDelaymS(50);
        }
        LED = 0;
        
        while(1)
        {
            handle_command();
            LED = 0;
        }
    } else if (mode == 1) {
        mInitSTDIO( );

        TI = 0;

        USBDeviceCfg();
        USBDeviceEndPointCfg();                                               // Endpoint configuration
        USBDeviceIntCfg();                                                    //Interrupt initialization
        UEP0_T_LEN = 0;
        UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
        UEP2_T_LEN = 0;

        ES = 1;

        LED = 1;
        while(1)
        {
            if(UsbConfig)
            {
                if(USBByteCount)   // USB receiving endpoint has data
                {
                    LED = !LED;
                    CH554UART0SendByte(Ep2Buffer[USBBufOutPoint++]);
                    recievedData[USBBufOutPoint] = Ep2Buffer[USBBufOutPoint];
                    USBByteCount--;

                    if(USBByteCount==0)
                        UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;

                    LED = !LED;

                }
                if(UartByteCount)
                    Uart_Timeout++;
                if(!UpPoint2_Busy)   // The endpoint is not busy (the first packet of data after idle, only used to trigger upload)
                {
                    length = UartByteCount;
                    if(length>0)
                    {
                        if(length>39 || Uart_Timeout>100)
                        {
                            LED = !LED;
                            Uart_Timeout = 0;
                            if(Uart_Output_Point+length>UART_REV_LEN)
                                length = UART_REV_LEN-Uart_Output_Point;
                            UartByteCount -= length;
                            // write upload endpoint
                            memcpy(Ep2Buffer+MAX_PACKET_SIZE,&Receive_Uart_Buf[Uart_Output_Point],length);

                            Uart_Output_Point+=length;
                            if (Uart_Output_Point>=UART_REV_LEN)
                                Uart_Output_Point = 0;
                            UEP2_T_LEN = length; // Pre-use send length must be cleared
                            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; // Answer ACK
                            UpPoint2_Busy = 1;
                            LED = !LED;
                        }
                    }
                }
            }
        }
    }
}
